<a href="https://colab.research.google.com/github/engnogueira/PythonParaCienciaDeDados/blob/master/07_removendo_dados_duplicados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Capítulo 1 - Manipulação de dados: Básico**

**Seção 7 - Removendo dados duplicados**

In [0]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
dados = {
    'coluna 1':[1,1,2,2,3,3,3],
    'coluna 2':['a', 'a', 'b', 'b', 'c', 'c', 'c'],
    'coluna 3':['A', 'A', 'B', 'B', 'C', 'C', 'C']}
df = DataFrame(dados)
df

   coluna 1 coluna 2 coluna 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

# **Removendo dados duplicados**

**nome_do_objeto.duplicated()**

In [3]:
df.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

**nome_do_objeto.drop_duplicates()**

In [4]:
df.drop_duplicates()

   coluna 1 coluna 2 coluna 3
0         1        a        A
2         2        b        B
4         3        c        C

In [7]:
df

   coluna 1 coluna 2 coluna 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [11]:
df.drop_duplicates(inplace=True)
df

   coluna 1 coluna 2 coluna 3
0         1        a        A
2         2        b        B
4         3        c        C

**nome_do_objeto.drop_duplicates(['nome_da_coluna')]**

In [13]:
dados = {
    'coluna 1':[1,1,2,2,3,3,3],
    'coluna 2':['a', 'a', 'b', 'b', 'c', 'c', 'c'],
    'coluna 3':['D', 'A', 'B', 'B', 'C', 'C', 'C']}
df = DataFrame(dados)
df

   coluna 1 coluna 2 coluna 3
0         1        a        D
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [14]:
df.drop_duplicates(['coluna 3'])

   coluna 1 coluna 2 coluna 3
0         1        a        D
1         1        a        A
2         2        b        B
4         3        c        C